In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('../data/movies.csv')

In [4]:
df

,name,year,length_min,genre,average_rating,cost_millions,foreign,age_restriction
0,Toy Story,1995,81,Animation,8.3,30.0,False,0
1,Akira,1998,125,Animation,8.1,10.4,False,14
2,The Breakfast Club,1985,97,Drama,7.9,1.0,False,14
3,The Artist,2011,100,Romance,8.0,15.0,False,12
4,Modern Times,1936,87,Comedy,8.6,1.5,False,10
5,Fight Club,1999,139,Drama,8.9,63.0,False,18
6,City of God,2002,130,Crime,8.7,3.3,True,18

In [6]:
df[df['name'] == 'The Artist']

,name,year,length_min,genre,average_rating,cost_millions,foreign,age_restriction
3,The Artist,2011,100,Romance,8.0,15.0,False,12